
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Компоновщик = Список.КомпоновщикНастроек;
		ИдентификаторПользовательскихОтборов = Компоновщик.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
		ПользовательскиеОтборы = Компоновщик.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскихОтборов);
		
		ИдентификаторПользовательскогоОтбора = "ОтборОрганизаций";
		
		ЭлементОтбораОрганизация = Неопределено;
		
		ПользовательскиеОтборы.Элементы.Очистить();
		
		//Для Каждого Элемент Из ПользовательскиеОтборы.Элементы Цикл
		//	Если Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскогоОтбора Тогда
		//		ЭлементОтбораОрганизация = Элемент;
		//		Прервать;
		//	КонецЕсли;
		//КонецЦикла;
		
		Если ЭлементОтбораОрганизация = Неопределено Тогда
			ЭлементОтбораОрганизация = ПользовательскиеОтборы.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораОрганизация.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскогоОтбора;
			ЭлементОтбораОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		КонецЕсли;
		
		спОрганизации = Новый СписокЗначений;
		спОрганизации.Добавить(Организация);
		спОрганизации.Добавить(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
		
		
		ЭлементОтбораОрганизация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбораОрганизация.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбораОрганизация.Использование = Истина;
		ЭлементОтбораОрганизация.ПравоеЗначение = спОрганизации;
		
	КонецЕсли; 

	
КонецПроцедуры

