
&Вместо("ЗагрузитьДанныеИзФайлаВыписки")
Процедура СМП_ЗагрузитьДанныеИзФайлаВыписки(
		ИдентификаторФормы = Неопределено,
		ИмяФайла = "",
		Организация = Неопределено,
		БанковскийСчет = Неопределено,
		СтатьяДДСВходящий = Неопределено,
		СтатьяДДСИсходящий = Неопределено,
		ПроводитьЗагружаемые = Ложь,
		ЗаполнятьДолгиАвтоматически = Ложь,
		Программа = "",
		Кодировка = "Авто",
		ВерсияФормата = "1.02",
		АвтоматическиПодставлятьДокументы = Истина,
		АнализироватьИсториюВыбораЗначенийРеквизитов = Истина,
		НастройкиПолучены = Ложь,
		НеУдалятьДокументыКоторыхНетВВыписке = Ложь,
		КонтролироватьБезопасностьОбменаСБанком = Истина,
		СпособЗачета = Неопределено,
		
		// СМП_РаботаСБанками +++
		ОбработкаПротокола
		// СМП_РаботаСБанками ---
		
		) Экспорт
		
	СтатьяДДСВходящий = ?(ЗначениеЗаполнено(СтатьяДДСВходящий), СтатьяДДСВходящий, ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ОплатаОтПокупателей"));
	СтатьяДДСИсходящий = ?(ЗначениеЗаполнено(СтатьяДДСИсходящий), СтатьяДДСИсходящий, ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам"));
	
	ЗагруженныеДокументы = Новый Массив;
	АдресВХранилище = "";
	Результат = Ложь;
	ПутьДоФайла1 = "kl_to_1c.txt";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("АдресВХранилище", АдресВХранилище);
	ДополнительныеПараметры.Вставить("ПутьДоФайла1", ПутьДоФайла1);
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ДополнительныеПараметры.Вставить("БанковскийСчет", БанковскийСчет);
	ДополнительныеПараметры.Вставить("НастройкиПолучены", НастройкиПолучены);
	ДополнительныеПараметры.Вставить("_ИмяФайла", ИмяФайла);
	ДополнительныеПараметры.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	
	Если НЕ НастройкиПолучены Тогда
		КлиентБанкВызовСервера.ЗагрузитьНастройкиОбменаСБанкомЧерезФайлы(БанковскийСчет, ДополнительныеПараметры);
	Иначе
		ДополнительныеПараметры.Вставить("СтатьяДДСВходящий", СтатьяДДСВходящий);
		ДополнительныеПараметры.Вставить("СтатьяДДСИсходящий", СтатьяДДСИсходящий);
		ДополнительныеПараметры.Вставить("ПроводитьЗагружаемые", ПроводитьЗагружаемые);
		ДополнительныеПараметры.Вставить("ЗаполнятьДолгиАвтоматически", ЗаполнятьДолгиАвтоматически);
		ДополнительныеПараметры.Вставить("Программа", Программа);
		
		// СМП_РаботаСБанками +++
		ДополнительныеПараметры.Вставить("ОбработкаПротокола", ОбработкаПротокола);
		// СМП_РаботаСБанками ---
		
		ДополнительныеПараметры.Вставить("Кодировка", Кодировка);
		ДополнительныеПараметры.Вставить("ВерсияФормата", ВерсияФормата);
		ДополнительныеПараметры.Вставить("АвтоматическиПодставлятьДокументы", АвтоматическиПодставлятьДокументы);
		ДополнительныеПараметры.Вставить("НеУдалятьДокументыКоторыхНетВВыписке", НеУдалятьДокументыКоторыхНетВВыписке);
		ДополнительныеПараметры.Вставить("АнализироватьИсториюВыбораЗначенийРеквизитов", АнализироватьИсториюВыбораЗначенийРеквизитов);
		ДополнительныеПараметры.Вставить("КонтролироватьБезопасностьОбменаСБанком", КонтролироватьБезопасностьОбменаСБанком);
		ДополнительныеПараметры.Вставить("СпособЗачета", СпособЗачета);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
	ПродолжитьВызов(ИдентификаторФормы, ИмяФайла, Организация, БанковскийСчет, СтатьяДДСВходящий, СтатьяДДСИсходящий, ПроводитьЗагружаемые, ЗаполнятьДолгиАвтоматически, Программа, Кодировка, ВерсияФормата, АвтоматическиПодставлятьДокументы, АнализироватьИсториюВыбораЗначенийРеквизитов, НастройкиПолучены, НеУдалятьДокументыКоторыхНетВВыписке, КонтролироватьБезопасностьОбменаСБанком, СпособЗачета);
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗагрузитьДанныеИзФайлаВыпискиФрагмент")
Процедура СМП_ЗагрузитьДанныеИзФайлаВыпискиФрагмент(ДополнительныеПараметры)

	Состояние(
	НСтр("ru='Выполняется чтение файла выписки...';uk='Виконується читання файлу виписки...'"),
	,
	НСтр("ru='Пожалуйста, подождите';uk='Будь ласка, зачекайте'"),
	БиблиотекаКартинок.ЗагрузкаДанных32
	);

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресФайлаКОбработке", ДополнительныеПараметры.АдресВХранилище);
	ПараметрыОткрытия.Вставить("ПутьДоФайла", ДополнительныеПараметры.ПутьДоФайла1);
	ПараметрыОткрытия.Вставить("Организация", ДополнительныеПараметры.Организация);
	ПараметрыОткрытия.Вставить("БанковскийСчетОрганизации", ДополнительныеПараметры.БанковскийСчет);
	
	#Вставка
	// СМП_РаботаСБанками +++
	ПараметрыОткрытия.Вставить("ОбработкаПротокола", ДополнительныеПараметры.ОбработкаПротокола);
	ПараметрыОткрытия.Вставить("СоглашениеПрямогоОбменаСБанками", ДополнительныеПараметры.ОбработкаПротокола);
	// СМП_РаботаСБанками ---
	#КонецВставки
	
	ПараметрыОткрытия.Вставить("СтатьяДДСВходящий", ДополнительныеПараметры.СтатьяДДСВходящий);
	ПараметрыОткрытия.Вставить("СтатьяДДСИсходящий", ДополнительныеПараметры.СтатьяДДСИсходящий);
	ПараметрыОткрытия.Вставить("ПроводитьЗагружаемые", ДополнительныеПараметры.ПроводитьЗагружаемые);
	ПараметрыОткрытия.Вставить("ЗаполнятьДолгиАвтоматически", ДополнительныеПараметры.ЗаполнятьДолгиАвтоматически);
	ПараметрыОткрытия.Вставить("Программа", ДополнительныеПараметры.Программа);
	ПараметрыОткрытия.Вставить("Кодировка", ДополнительныеПараметры.Кодировка);
	ПараметрыОткрытия.Вставить("ВерсияФормата", ДополнительныеПараметры.ВерсияФормата);
	ПараметрыОткрытия.Вставить("АвтоматическиПодставлятьДокументы", ДополнительныеПараметры.АвтоматическиПодставлятьДокументы);
	ПараметрыОткрытия.Вставить("АнализироватьИсториюВыбораЗначенийРеквизитов", ДополнительныеПараметры.АнализироватьИсториюВыбораЗначенийРеквизитов);
	ПараметрыОткрытия.Вставить("НастройкиПолучены", ДополнительныеПараметры.НастройкиПолучены);
	ПараметрыОткрытия.Вставить("НеУдалятьДокументыКоторыхНетВВыписке", ДополнительныеПараметры.НеУдалятьДокументыКоторыхНетВВыписке);
	ПараметрыОткрытия.Вставить("КонтролироватьБезопасностьОбменаСБанком", ДополнительныеПараметры.КонтролироватьБезопасностьОбменаСБанком);
	ПараметрыОткрытия.Вставить("СпособЗачета", ДополнительныеПараметры.СпособЗачета);

	ОткрытьФорму(
	
	#Удаление
	"Обработка.КлиентБанк.Форма.ФормаЗагрузка",
	#КонецУдаления
	
	#Вставка
	"Обработка.СМП_КлиентБанк.Форма.ФормаЗагрузка",
	#КонецВставки
	
	ПараметрыОткрытия
	);

КонецПроцедуры
