#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЕстьЗаписи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СМП_СоответствияНазначенийИРеквизитовПлатежа.Ссылка
	|ИЗ
	|	Справочник.СМП_СоответствияНазначенийИРеквизитовПлатежа КАК СМП_СоответствияНазначенийИРеквизитовПлатежа
	|ГДЕ
	|	НЕ СМП_СоответствияНазначенийИРеквизитовПлатежа.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
