#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Запись последней транзакции.
//
// Параметры:
//   <Параметр1> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//   <Параметр2> - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаписатьДанные(пБанковскийСчет, пИдТранзакции, пДата) Экспорт
	
	МЗ = РегистрыСведений.СМП_НомерПоследнейТранзакции.СоздатьМенеджерЗаписи();
	МЗ.БанковскийСчет = пБанковскийСчет;
	МЗ.ИДТранзакции = пИдТранзакции;
	МЗ.ДатаТранзакции = пДата;
	МЗ.Записать();
	
КонецПроцедуры //ЗаписатьДанные


#КонецОбласти

#КонецЕсли
