#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "ПриватБанк") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИД");
		ПроверяемыеРеквизиты.Добавить("Токен");
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "МОНОБанк") Тогда
		
		ПроверяемыеРеквизиты.Добавить("Токен");
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "ПУМБ") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИД");
		ПроверяемыеРеквизиты.Добавить("Токен");
		ПроверяемыеРеквизиты.Добавить("Логин");
		ПроверяемыеРеквизиты.Добавить("Пароль");
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "ПодключаемаяОбработка") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ПодключаемаяОбработка");
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	ПодключаемаяОбработка = Неопределено;
	ИД = "";
	Токен = "";
	Логин = "";
	Пароль = "";
	ГруппаДоступаДляНовыхКонтрагентов = Неопределено;
	СоздатьНовогоКонтрагентаПриЗагрузкеВыписки = Ложь;
	ИспользоватьРегламентныеЗадания = Ложь;
	ИдентификаторРегламентногоЗадания = Неопределено;
	АдресДляWebHook = "";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли