
&НаСервере
Процедура СМП_ПолучитьДанныеСНовопейПослеНаСервере()
	СтрРеестр = "реєстру № ";
	ПозНачала = Найти(Объект.НазначениеПлатежа, СтрРеестр) + СтрДлина(СтрРеестр);
	ОстатокСтроки = Сред(Объект.НазначениеПлатежа, ПозНачала);
	ПозКонца = Найти(ОстатокСтроки, " ");
	НомерРеестра = СокрЛП(Лев(ОстатокСтроки, ПозКонца));
	
	УчетнаяЗаписьБанка = Справочники.СМП_УчетныеЗаписиБанков.НайтиПоРеквизиту("БанковскийСчет", Объект.БанковскийСчет);
	ДанныеРеестра = СМП_РаботаСБанкамиNovaPayAPIСервер.ПолучитьДанныеРеестра(УчетнаяЗаписьБанка, Объект.Дата, НомерРеестра); 
	
	Если ТИПЗНЧ(ДанныеРеестра) = ТИП("ТаблицаЗначений") Тогда
		Для каждого строка из ДанныеРеестра Цикл
			СтрокаРасшифровкаПлатежаОтАгента = Объект.РасшифровкаПлатежаОтАгента.Добавить();
			СтрокаРасшифровкаПлатежаОтАгента.Заказ = НайтиЗаказПокупателя(строка);
			РасшифровкаПлатежаОтАгентаЗаказПриИзмененииНаСервере(СтрокаРасшифровкаПлатежаОтАгента.ПолучитьИдентификатор());
			СтрокаРасшифровкаПлатежаОтАгента.ПолученоОтКлиента = строка.СумаПрийнятих;
			СтрокаРасшифровкаПлатежаОтАгента.УдержаноАгентом = строка.СумаУтриманої;
			СтрокаРасшифровкаПлатежаОтАгента.СуммаПлатежа = строка.СумаПерерахованих;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиЗаказПокупателя(Данные)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	НЕ ЗаказПокупателя.ПометкаУдаления
	               |	И ЗаказПокупателя.Номер = &Номер";
	Запрос.УстановитьПараметр("Номер", Данные.НомерЗамовлення);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документы.ЗаказПокупателя.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ОбновитьВидимость()
	УчетнаяЗаписьБанка = Справочники.СМП_УчетныеЗаписиБанков.НайтиПоРеквизиту("БанковскийСчет", Объект.БанковскийСчет);
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьБанка) И УчетнаяЗаписьБанка.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.NovaPay И ЗначениеЗаполнено(УчетнаяЗаписьБанка.ИД) Тогда
		ЭтаФорма.Элементы.РасшифровкаПлатежаОтАгентаПолучитьДанныеСНовопей.Видимость = Истина;
	Иначе                                                                                     
		ЭтаФорма.Элементы.РасшифровкаПлатежаОтАгентаПолучитьДанныеСНовопей.Видимость = Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СМП_ПолучитьДанныеСНовопейПосле(Команда)
	СМП_ПолучитьДанныеСНовопейПослеНаСервере();
КонецПроцедуры   

&НаКлиенте
Процедура СМП_БанковскийСчетПриИзмененииПосле(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СМП_ПриОткрытииПосле(Отказ)
	ОбновитьВидимость();
КонецПроцедуры
