
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПраваяЧастьСообщения = НСтр("ru = 'Обработано строк: '")+Параметры.ОбработаноСтрок+НСтр("ru = '. Всего строк: '")+Параметры.ВсегоСтрок+".";
	Если Параметры.ЕстьПредупреждения Тогда
		Элементы.СтраницыРезультатЗавершения.ТекущаяСтраница = Элементы.СтраницаСПредупреждениями;
		Элементы.НадписьСПредупрежедниями.Заголовок = Элементы.НадписьСПредупрежедниями.Заголовок + Символы.ПС + Символы.ПС + ПраваяЧастьСообщения;
	Иначе
		Элементы.НадписьБезПредупреждений.Заголовок = Элементы.НадписьБезПредупреждений.Заголовок + Символы.ПС + Символы.ПС + ПраваяЧастьСообщения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	Закрыть(Новый Структура("ПоказатьПротокол", Истина));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти



