#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Загрузка данных с банка.
//
// Параметры:
//   пСтруктураПараметров - структура - настройки для получения данных.
//   пУчетнаяЗаписьБанка - СправочникСсылка.СМП_УчетныеЗаписиБанков - Учетная запись дял получения данных.
//
Процедура Загрузить(пСтруктураПараметров, пУчетнаяЗаписьБанка, ЭтоРеглЗадание = Ложь) Экспорт
	
	сПараметрыДоступа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(пУчетнаяЗаписьБанка, "Банк, ИД, Токен, Логин, Пароль");
	пСтруктураПараметров.Вставить("ПараметрыДоступа", сПараметрыДоступа);
	
	Если сПараметрыДоступа.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПриватБанк Тогда
		
		МодульБанка = ОбщегоНазначения.ОбщийМодуль("СМП_РаботаСБанкамиПриватБанкAPIСервер");
		МодульБанка.Прочитать(пСтруктураПараметров, пУчетнаяЗаписьБанка, ЭтоРеглЗадание);
		
	ИначеЕсли сПараметрыДоступа.Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПУМБ Тогда
		
		МодульБанка = ОбщегоНазначения.ОбщийМодуль("СМП_РаботаСБанкамиПУМБAPIСервер");
		МодульБанка.Прочитать(пСтруктураПараметров, пУчетнаяЗаписьБанка, ЭтоРеглЗадание);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли