#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПредопределенныеОбработчикиОбъекта

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПриватБанк Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ПодключаемаяОбработка");
		
	ИначеЕсли Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.МОНОБанк Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ПодключаемаяОбработка");
		
	ИначеЕсли Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПУМБ Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ПодключаемаяОбработка");
	    МассивНепроверяемыхРеквизитов.Добавить("ИД");
		МассивНепроверяемыхРеквизитов.Добавить("Токен");
		
	ИначеЕсли Банк = Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПодключаемаяОбработка Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ИД");
		МассивНепроверяемыхРеквизитов.Добавить("Токен");
				
	КонецЕсли;
	
	Если Банк <> Перечисления.СМП_ПоддерживаемыеИнтеграцииСБанками.ПУМБ Тогда
	
		МассивНепроверяемыхРеквизитов.Добавить("Username");
		МассивНепроверяемыхРеквизитов.Добавить("password");
		МассивНепроверяемыхРеквизитов.Добавить("client_id");
		МассивНепроверяемыхРеквизитов.Добавить("client_secret");
	
	КонецЕсли; 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#КонецЕсли