
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура СМП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	СМП_СоздатьЭлементыФормыПрограммно();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СМП_СоздатьЭлементыФормыПрограммно()
	
	// Срок действия
	СМП_СрокДействия = ЭтаФорма.Элементы.Добавить("СМП_СрокДействия", Тип("ПолеФормы"), Элементы.ГруппаВидДоговора);
	СМП_СрокДействия.Вид = ВидПоляФормы.ПолеВвода;
	СМП_СрокДействия.Заголовок = НСтр("ru = 'до'; uk = 'до'");
	СМП_СрокДействия.ПутьКДанным = "Объект.СМП_СрокДействия";
	
	// Недействителен
	СМП_Недействителен = ЭтаФорма.Элементы.Добавить("СМП_Недействителен", Тип("ПолеФормы"), Элементы.ГруппаВидДоговора);
	СМП_Недействителен.Вид = ВидПоляФормы.ПолеФлажка;
	СМП_Недействителен.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	СМП_Недействителен.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	СМП_Недействителен.ПутьКДанным = "Объект.СМП_Недействителен";
	
КонецПроцедуры

#КонецОбласти
